# -*- coding: utf-8 -*-
import random

import simple_draw as sd

sd.resolution = (1200, 600)


# point=sd.get_point(300,300)

# Нарисовать пузырек - три вложенных окружностей с шагом 5 пикселей
# ----------------------------------------------------------------
# rad=100
# for _ in range(3):
#     rad += 5
#     sd.circle(point,rad)
# ----------------------------------------------------------------
# Написать функцию рисования пузырька, принммающую 2 (или более) параметра: точка рисовании и шаг
def buble(centr_point_x, centr_point_y, rad, step, count):
    for _ in range(count):
        centr_point = sd.get_point(centr_point_x, centr_point_y)
        rad += step
        sd.circle(centr_point, rad)


# buble(300,300,100,5,10)
# Нарисовать 10 пузырьков в ряд
# ----------------------------------------------------------------
# x=0
# for _ in range(10):
#     x += 100
#     buble(x, 300, 50, 5, 1)
# ----------------------------------------------------------------
# Нарисовать три ряда по 10 пузырьков
# ----------------------------------------------------------------
#
# x = 0
# y = 300
# for verticale in range(3):
#     y -= 60
#     for x in range(100,1001,100):
#         buble(x, y, 20, 5, 1)
# # ----------------------------------------------------------------
# # Нарисовать 100 пузырьков в произвольных местах экрана случайными цветами
for _ in range(100):
    x = random.randrange(10,1000)
    y = random.randrange(10,500)
    rad = random.randrange(10,100)
    buble(x,y,rad,1,1)


sd.pause()
